zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.c
    return capStatus;
}
#endif /* (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_PROXIMITY_EN) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TOUCHPAD_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MATRIX_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SLIDER_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_GetTouchInfo
****************************************************************************//**
*
* Reports the details of touch position detected on the specified touchpad,
* matrix buttons, slider or liquid level widgets.
*
* This function does not process widget data but extracts previously processed
* results from the \ref group_capsense_structures.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the pointer to widget cy_stc_capsense_touch_t structure that
* contains number of positions and data about each position.
*
*
*******************************************************************************/
cy_stc_capsense_touch_t * Cy_CapSense_GetTouchInfo(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_touch_t * ptrTouch = NULL;

    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    if (widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];
        switch (ptrWdCfg->wdType)
        {
            case (uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E:
            case (uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E:
            case (uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E:
            case (uint8_t)CY_CAPSENSE_WD_RADIAL_SLIDER_E:
            case (uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E:
            case (uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E:
                ptrTouch = &ptrWdCfg->ptrWdContext->wdTouch;
                break;

            default:
                /* No action on other widget types */
                break;
        }
    }

    return ptrTouch;
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TOUCHPAD_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MATRIX_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SLIDER_EN) || \
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_EN)) */


#if (CY_CAPSENSE_LIQUID_LEVEL_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_GetLiquidWidgetPosition
****************************************************************************//**
*
* Reports the current liquid level position of the specified liquid level widget.
*
* This function does not process widget data but extracts previously processed
* results from the \ref group_capsense_structures.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;
* and is applicable to widgets of the \ref CY_CAPSENSE_WD_LIQUID_LEVEL_E type.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the current liquid level position scaled to the widget resolution.
* Returns \ref CY_CAPSENSE_LLS_INVALID if the specified widget is not
* a liquid level widget or a wrong widgetId is specified.
*
*******************************************************************************/
uint16_t Cy_CapSense_GetLiquidWidgetPosition(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context)
{
    uint16_t position = CY_CAPSENSE_LLS_INVALID;

    if (widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
    {
        if ((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E == context->ptrWdConfig[widgetId].wdType)
        {
            position = context->ptrWdConfig[widgetId].ptrWdContext->wdTouch.ptrPosition->x;
        }
    }

    return position;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetLiquidPresenceLevel
****************************************************************************//**
*
* Reports the current liquid presence level of the specified
* liquid presence widget.
*
* This function does not process widget data but extracts previously processed
* results from the \ref group_capsense_structures.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;
* and is applicable to widgets of the \ref CY_CAPSENSE_WD_LIQUID_PRESENCE_E
* and \ref CY_CAPSENSE_WD_LIQUID_LEVEL_E types when multi-level detection
* feature is enabled.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the highest confirmed liquid presence level:
* - \ref CY_CAPSENSE_LIQUID_PRESENCE_LEVEL_NONE - No liquid presence detected.
* - \ref CY_CAPSENSE_LIQUID_PRESENCE_LEVEL1     - Liquid presence level 1 detected.
* - \ref CY_CAPSENSE_LIQUID_PRESENCE_LEVEL2     - Liquid presence level 2 detected.
* - \ref CY_CAPSENSE_LIQUID_PRESENCE_LEVEL3     - Liquid presence level 3 detected.
* - \ref CY_CAPSENSE_LLS_INVALID                - The specified widget is not
*   a liquid presence / liquid level widget or a wrong widgetId is specified.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetLiquidPresenceLevel(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context)
{
    uint32_t presenceLevel = CY_CAPSENSE_LLS_INVALID;
    uint32_t status;

    if (widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
    {
        if (((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E == context->ptrWdConfig[widgetId].wdType) ||
            ((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E == context->ptrWdConfig[widgetId].wdType))
        {
            status = context->ptrWdContext[widgetId].status;

