zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.c
            if (0u != (status & CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL3_MASK))
            {
                presenceLevel = CY_CAPSENSE_LIQUID_PRESENCE_LEVEL3;
            }
            else if (0u != (status & CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL2_MASK))
            {
                presenceLevel = CY_CAPSENSE_LIQUID_PRESENCE_LEVEL2;
            }
            else if (0u != (status & CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL1_MASK))
            {
                presenceLevel = CY_CAPSENSE_LIQUID_PRESENCE_LEVEL1;
            }
            else
            {
                presenceLevel = CY_CAPSENSE_LIQUID_PRESENCE_LEVEL_NONE;
            }
        }
    }

    return presenceLevel;
}


#if (CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_GetFoamWidgetPosition
****************************************************************************//**
*
* Reports the current position of the specified foam widget.
*
* The foam widget is a liquid level sub-widget dedicated to Foam Detection
* measurement. It is placed as the widget immediately preceding the main
* liquid level widget in the widget array. This function does not process
* widget data but extracts previously processed results from the
* \ref group_capsense_structures.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;
* when the Liquid Level Foam Detection feature is enabled, and is applicable
* to widgets of the \ref CY_CAPSENSE_WD_LIQUID_LEVEL_E type.
*
* \param widgetId
* Specifies the ID number of the foam widget. A macro for the widget ID can
* be found in the cycfg_capsense.h file defined as
* CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the current foam widget position scaled to the widget resolution.
* Returns \ref CY_CAPSENSE_LLS_INVALID if the specified widget is not
* a liquid level widget or a wrong widgetId is specified.
*
*******************************************************************************/
uint16_t Cy_CapSense_GetFoamWidgetPosition(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context)
{
    uint16_t position = CY_CAPSENSE_LLS_INVALID;

    if (widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
    {
        if ((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E == context->ptrWdConfig[widgetId].wdType)
        {
            position = context->ptrWdConfig[widgetId].ptrWdContext->wdTouch.ptrPosition->x;
        }
    }

    return position;
}
#endif /* (CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN) */
#endif /* (CY_CAPSENSE_LIQUID_LEVEL_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_CheckConfigIntegrity
****************************************************************************//**
*
* Performs verification of CAPSENSE&trade; data structure initialization.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns status of operation:
* - Zero        - Indicates successful initialization.
* - Non-zero    - One or more errors occurred in the initialization process.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CheckConfigIntegrity(const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;

    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    const cy_stc_capsense_common_context_t * ptrCommonCxt = context->ptrCommonContext;
    const cy_stc_capsense_internal_context_t * ptrInternalCxt = context->ptrInternalContext;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = context->ptrWdConfig;
    const cy_stc_capsense_widget_context_t * ptrWdCxt = context->ptrWdContext;
    const cy_stc_capsense_pin_config_t * ptrPinCfg = context->ptrPinConfig;
    const cy_stc_capsense_active_scan_sns_t * ptrActScanSns = context->ptrActiveScanSns;

    if (ptrCommonCfg == NULL)       {capStatus = CY_CAPSENSE_STATUS_BAD_DATA;}
    if (ptrCommonCxt == NULL)       {capStatus = CY_CAPSENSE_STATUS_BAD_DATA;}
    if (ptrInternalCxt == NULL)     {capStatus = CY_CAPSENSE_STATUS_BAD_DATA;}
    if (ptrWdCfg == NULL)           {capStatus = CY_CAPSENSE_STATUS_BAD_DATA;}
    if (ptrWdCxt == NULL)           {capStatus = CY_CAPSENSE_STATUS_BAD_DATA;}
    if (ptrPinCfg == NULL)          {capStatus = CY_CAPSENSE_STATUS_BAD_DATA;}
    if (ptrActScanSns == NULL)      {capStatus = CY_CAPSENSE_STATUS_BAD_DATA;}

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetCRC
****************************************************************************//**
*
* Calculates CRC for the specified buffer and length.
*
* This API is used for the CRC protection of a packet received from
* the CAPSENSE&trade; Tuner tool and for BIST operations.
* CRC polynomial is 0xAC9A. It has a Hamming distance 5 for data words
* up to 241 bits.
*
* Reference:  "P. Koopman, T. Chakravarthy,
* "Cyclic Redundancy Code (CRC) Polynomial Selection for Embedded Networks",
* The International Conference on Dependable Systems and Networks, DSN-2004"
*
* \param ptrData
* The pointer to the data.
*
* \param len
* The length of the data in bytes.
*
* \return
* Returns a calculated CRC-16 value.
*
*******************************************************************************/
uint16_t Cy_CapSense_GetCRC(const uint8_t *ptrData, uint32_t len)
{
    uint32_t idx;
    uint32_t actualCrc = 0u;
    uint32_t length = len;
    const uint8_t * ptrDataLocal = ptrData;
    const uint16_t crcTable[] =
    {
        0x0000u, 0xAC9Au, 0xF5AEu, 0x5934u, 0x47C6u, 0xEB5Cu, 0xB268u, 0x1EF2u,
        0x8F8Cu, 0x2316u, 0x7A22u, 0xD6B8u, 0xC84Au, 0x64D0u, 0x3DE4u, 0x917Eu
    };

    for (;length-- > 0u;)
    {
        /* Process HI Nibble */
        idx = ((actualCrc >> 12u) ^ (((uint32_t)*ptrDataLocal) >> 4u)) & 0xFLu;
        actualCrc = crcTable[idx] ^ (actualCrc << 4u);

        /* Process LO Nibble */
        idx = ((actualCrc >> 12u) ^ (uint32_t)*ptrDataLocal) & 0xFLu;
        actualCrc = crcTable[idx] ^ (actualCrc << 4u);

