zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.c
        ptrDataLocal++;
    }

    return (uint16_t)actualCrc;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetCrcWidget
****************************************************************************//**
*
* Calculates CRC for the specified widget. This function implements the
* following functionality:
* - Fills the \ref cy_stc_capsense_widget_crc_data_t with 0.
* - Initializes fields of the \ref cy_stc_capsense_widget_crc_data_t with the
*   data from corresponding fields of the \ref cy_stc_capsense_widget_context_t.
* - Executes the Cy_CapSense_GetCRC() routine for full
*   \ref cy_stc_capsense_widget_crc_data_t, structure, including padding.
* If the tuning mode is set to smart sensing algorithm (full auto-tune)
* then the fields of the \ref cy_stc_capsense_widget_context_t that changing
* it's value in the run-time will be excluded from CRC calculation for the
* CSD and ISX widgets.
*
* \param widgetId
* Specifies the ID number of the widget.
* A macro for the widget ID can be found in the
* CAPSENSE&trade; Configuration header file (cycfg_capsense.h) defined as
* CY_CAPSENSE_<WidgetName>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a calculated CRC-16 value.
*
*******************************************************************************/
uint16_t Cy_CapSense_GetCrcWidget(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint16_t crcValue;
    const cy_stc_capsense_widget_context_t * ptrWdCxt;
    cy_stc_capsense_widget_crc_data_t crcDataVal;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];

    /* Get a pointer to the specified widget context structure */
    ptrWdCxt = &context->ptrWdContext[widgetId];

    (void)memset((void*)&crcDataVal, 0, sizeof(crcDataVal));

    crcDataVal.fingerCapVal = ptrWdCxt->fingerCap;
    crcDataVal.sigPFCVal = ptrWdCxt->sigPFC;
    crcDataVal.lowBslnRstVal = ptrWdCxt->lowBslnRst;
    crcDataVal.snsClkVal = ptrWdCxt->snsClk;
    crcDataVal.rowSnsClkVal = ptrWdCxt->rowSnsClk;
    crcDataVal.onDebounceVal = ptrWdCxt->onDebounce;
    crcDataVal.snsClkSourceVal = ptrWdCxt->snsClkSource;
    crcDataVal.maxRawCountVal = ptrWdCxt->maxRawCount;
    crcDataVal.maxRawCountRowVal = ptrWdCxt->maxRawCountRow;
    crcDataVal.bslnCoeffVal = ptrWdCxt->bslnCoeff;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MPSC_EN)
        if (ptrWdCfg->mpOrder >= CY_CAPSENSE_MPSC_MIN_ORDER)
        {
            crcDataVal.fingerThVal = ptrWdCxt->fingerTh;
            crcDataVal.proxThVal = ptrWdCxt->proxTh;
            crcDataVal.noiseThVal = ptrWdCxt->noiseTh;
            crcDataVal.nNoiseThVal = ptrWdCxt->nNoiseTh;
            crcDataVal.hysteresisVal = ptrWdCxt->hysteresis;
        }
    #endif

    if ((CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod) ||
        ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType) ||
        ((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E == ptrWdCfg->wdType) ||
        ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E == ptrWdCfg->wdType) ||
        ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) && (CY_CAPSENSE_ENABLE != CY_CAPSENSE_SMARTSENSE_CSD_ACTIVE_FULL_EN)) ||
        ((CY_CAPSENSE_ISX_GROUP == ptrWdCfg->senseMethod) && (CY_CAPSENSE_ENABLE != CY_CAPSENSE_SMARTSENSE_ISX_ACTIVE_FULL_EN)) ||
        (CY_CAPSENSE_WBX_GROUP == ptrWdCfg->senseMethod))
    {
        crcDataVal.fingerThVal = ptrWdCxt->fingerTh;
        crcDataVal.proxThVal = ptrWdCxt->proxTh;
        crcDataVal.noiseThVal = ptrWdCxt->noiseTh;
        crcDataVal.nNoiseThVal = ptrWdCxt->nNoiseTh;
        crcDataVal.hysteresisVal = ptrWdCxt->hysteresis;
        #if (CY_CAPSENSE_LIQUID_LEVEL_MULTI_LEVEL_EN)
            crcDataVal.liquidPresenceLevel2Val = ptrWdCxt->liquidPresenceLevel2;
            crcDataVal.liquidPresenceLevel3Val = ptrWdCxt->liquidPresenceLevel3;
        #endif
    }

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        crcDataVal.resolutionVal = ptrWdCxt->resolution;
        crcDataVal.idacModVal[0u] = ptrWdCxt->idacMod[0u];
        crcDataVal.idacModVal[1u] = ptrWdCxt->idacMod[1u];
        crcDataVal.idacModVal[2u] = ptrWdCxt->idacMod[2u];
        crcDataVal.idacGainIndexVal = ptrWdCxt->idacGainIndex;
        crcDataVal.rowIdacModVal[0u] = ptrWdCxt->rowIdacMod[0u];
        crcDataVal.rowIdacModVal[1u] = ptrWdCxt->rowIdacMod[1u];
        crcDataVal.rowIdacModVal[2u] = ptrWdCxt->rowIdacMod[2u];
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        crcDataVal.cdacDitherEnVal = ptrWdCxt->cdacDitherEn;
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        crcDataVal.cicShiftVal = ptrWdCxt->cicShift;
        crcDataVal.rowCicShiftVal = ptrWdCxt->rowCicShift;
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        crcDataVal.resolutionVal = ptrWdCxt->numSubConversions;
        crcDataVal.cdacRefVal = ptrWdCxt->cdacRef;
        crcDataVal.rowCdacRefVal = ptrWdCxt->rowCdacRef;
        crcDataVal.cdacCompDividerVal = ptrWdCxt->cdacCompDivider;
        crcDataVal.cicRateVal = ptrWdCxt->cicRate;
        crcDataVal.lfsrBitsVal = ptrWdCxt->lfsrBits;
        crcDataVal.cdacDitherValueVal = ptrWdCxt->cdacDitherValue;
        crcDataVal.coarseInitBypassEnVal = ptrWdCxt->coarseInitBypassEn;
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && \
         ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_FINE_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_FINE_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_FINE_EN) || \
          (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_FINE_EN)))
        crcDataVal.cdacFineVal = ptrWdCxt->cdacFine;
        crcDataVal.rowCdacFineVal = ptrWdCxt->rowCdacFine;
    #endif

    crcValue = Cy_CapSense_GetCRC((uint8_t *)(&crcDataVal), sizeof(crcDataVal));

    return crcValue;
}


