zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.c
    uint8_t * bytePtr;
    uint16_t * halfWordPtr;
    uint32_t * wordPtr;

    if ((context == NULL) || (ptrTuner == NULL))
    {
        capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    /* Parse paramId */
    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        paramOffset = (uint16_t)(paramId);
        paramType = (paramId & CY_CAPSENSE_PARAM_TYPE_MASK) >> CY_CAPSENSE_PARAM_TYPE_OFFSET;

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
            paramCrc = (paramId & CY_CAPSENSE_PARAM_CRC_MASK) >> CY_CAPSENSE_PARAM_CRC_OFFSET;
            paramWidget = (paramId & CY_CAPSENSE_PARAM_WIDGET_MASK) >> CY_CAPSENSE_PARAM_WIDGET_OFFSET;
            if ((paramWidget > context->ptrCommonConfig->numWd) && (0u != paramCrc))
            {
                capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
            }
        #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&
                   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */
    }

    /* Check parameter type, offset alignment, write the specified parameter */
    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
    {
        switch (paramType)
        {
            case CY_CAPSENSE_DS_PARAM_TYPE_UINT32:
                if (0u == (paramOffset & CY_CAPSENSE_UINT32_ALIGN_MASK))
                {
                    paramOffset >>= 2u;
                    wordPtr = (uint32_t *)ptrTuner;
                    wordPtr[paramOffset] = value;
                }
                break;
            case CY_CAPSENSE_DS_PARAM_TYPE_UINT16:
                if (0u == (paramOffset & CY_CAPSENSE_UINT16_ALIGN_MASK))
                {
                    paramOffset >>= 1u;
                    halfWordPtr = (uint16_t *)ptrTuner;
                    halfWordPtr[paramOffset] = (uint16_t)value;
                }
                break;
            case CY_CAPSENSE_DS_PARAM_TYPE_UINT8:
               bytePtr = (uint8_t *)ptrTuner;
               bytePtr[paramOffset] = (uint8_t)value;
               break;
            default:
                capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                break;
        }
    }

    /* Update widget CRC if needed */
    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
        if ((CY_CAPSENSE_STATUS_SUCCESS == capStatus) &&
            (0u != paramCrc))
        {
            Cy_CapSense_UpdateCrcWidget(paramWidget, context);
        }
    #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&
               (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN)) */

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetWidgetStatus
****************************************************************************//**
*
* Performs configuring of the selected widget.
*
* This function performs customized widget status configuration
* by the mode parameter. There are two general use cases for this function:
* 1. Make the specified widget Enabled/Disabled. This status is intended
*    to define a set of widgets to be scanned/processed from the application
*    layer.
* 2. Make the specified widget Working/Non-working. This status is
*    integrated into the built-in self-test (BIST) library. If a test detects
*    non-working widget, that widget status is set to non-working automatically
*    by CAPSENSE&trade;. BIST never resets a widget working mask and the user
*    makes a decision what to do next with this non-working widget.
*
* Although other statuses can be changed by this function, this is not
* recommended to avoid impact on CAPSENSE&trade; operation and
* is needed to implement only specific use cases.
*
* By default, all widgets are enabled and working during CAPSENSE&trade;
* initialization. All disabled or non-working widgets are excluded
* from scanning and processing.
*
* Excluding a widget from a scanning flow happens
* immediately by re-generation a new scanning frame. This function does it
* for optimization, which means that scanning functions save
* CPU time by checking if any widget status was changed.
*
* Excluding from processing flow happens inside the process functions since they
* perform processing by widgets and not by slots. Therefore, changing
* the widget status should happen before a new scan and/or after processing.
*
* The Cy_CapSense_ProcessWidgetExt() and Cy_CapSense_ProcessSensorExt()
* functions ignore widget disable and non-working statuses and perform
* processing based on specified mode provided to those functions.
*
* The function also checks if there is at least one enabled and working widget.
* If no valid widgets are left for scanning, the function returns
* CY_CAPSENSE_STATUS_BAD_CONFIG separately for active and low-power
* widgets due to these groups' independent scanning frames.
*
* \note
* For the fifth generation and fifth-generation low power CAPSENSE&trade;,
* if the specified widget has the enabled multi-frequency scan feature,
* then the status configuration happens to all the joined widgets:
* * Sub-widget channel 2
* * Sub-widget channel 1
* * Main widget channel 0
*
* \param widgetId
* Specifies the widget ID number. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param mode
* Specifies the bit mask of widget status to be configured. It is allowed
* to configure several bits simultaneously.
* 1. Bit [0]      - CY_CAPSENSE_WD_ACTIVE_MASK
* 2. Bit [1]      - CY_CAPSENSE_WD_ENABLE_MASK
* 3. Bit [2]      - CY_CAPSENSE_WD_WORKING_MASK
* 4. Bit [3]      - CY_CAPSENSE_WD_MAXCOUNT_CALC_MASK
* 5. Bit [4]      - CY_CAPSENSE_WD_MAXCOUNT_ROW_CALC_MASK.
*
* \param mask
* Specifies the value of widget status field to be configured. All bit values
* not set by the mask passed as the mode parameter are ignored.
*
* \param context
* The pointer to the CAPSENSE&trade; context
* structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the widget processing operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The operation is successful.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - The input parameter is invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SetWidgetStatus(
                uint32_t widgetId,
                uint32_t mode,
                uint32_t mask,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_CONFIG;
    #if (((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) &&\
         (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN))
        const cy_stc_capsense_widget_config_t * ptrWdCfg = context->ptrWdConfig;
        uint32_t wdIndex;
    #endif

    /* Check parameter validity */
    if (widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
    {
        capStatus = CY_CAPSENSE_STATUS_SUCCESS;
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
            context->ptrWdContext[widgetId].status &= ~mode;
            context->ptrWdContext[widgetId].status |= (mask & mode);
            (void)Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_UNDEFINED_GROUP, context);
        #else
            /* Update scan flags for MSC platforms */
            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                context->ptrInternalContext->repeatScanEn = CY_CAPSENSE_DISABLE;
                context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_WD_SCAN_MASK);
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN)
                /* Checks if MFS is enabled for particular widget */
                if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_EN_MASK))
                {
                    wdIndex = widgetId - (((uint32_t)ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_MASK) >> CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_POS);
                    context->ptrWdContext[wdIndex].status &= ~mode;
                    context->ptrWdContext[wdIndex].status |= (mask & mode);
                    context->ptrWdContext[wdIndex + CY_CAPSENSE_MFS_CH1_INDEX].status &= ~mode;
                    context->ptrWdContext[wdIndex + CY_CAPSENSE_MFS_CH1_INDEX].status |= (mask & mode);
                    context->ptrWdContext[wdIndex + CY_CAPSENSE_MFS_CH2_INDEX].status &= ~mode;
                    context->ptrWdContext[wdIndex + CY_CAPSENSE_MFS_CH2_INDEX].status |= (mask & mode);
                    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                        Cy_CapSense_SetSnsFrameValidity(wdIndex, context);
                        Cy_CapSense_SetSnsFrameValidity(wdIndex + CY_CAPSENSE_MFS_CH1_INDEX, context);
                        Cy_CapSense_SetSnsFrameValidity(wdIndex + CY_CAPSENSE_MFS_CH2_INDEX, context);
                    #endif
                }
                else
                {
                    context->ptrWdContext[widgetId].status &= ~mode;
                    context->ptrWdContext[widgetId].status |= (mask & mode);
                    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                        Cy_CapSense_SetSnsFrameValidity(widgetId, context);
                    #endif
                }
            #else
                context->ptrWdContext[widgetId].status &= ~mode;
                context->ptrWdContext[widgetId].status |= (mask & mode);
                #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                    Cy_CapSense_SetSnsFrameValidity(widgetId, context);
                #endif
            #endif
            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
                context->ptrInternalContext->scanSingleSlot = CY_CAPSENSE_SCAN_MULTIPLE_SLOT;
                #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                    (void)Cy_CapSense_ConfigureDmaArrays(context);
                #endif
            #endif
        #endif
    }

