zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.c
    return capStatus;
}


#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
/*******************************************************************************
* Function Name: Cy_CapSense_SetSnsFrameValidity
****************************************************************************//**
*
* Performs sensor frame update for the specified widget.
*
* For the fifth generation and fifth-generation low power CAPSENSE&trade;,
* if the specified widget has the enabled multi-frequency scan feature,
* then the frame update happens to the specified widget Id only.
*
* \param widgetId
* Specifies the widget ID number. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context
* structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetSnsFrameValidity(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t wdStatus = 0u;
    uint32_t * ptrSnsFrmCxt;
    uint32_t snsIndex;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    uint32_t frameSize = CY_CAPSENSE_SENSOR_FRAME_SIZE;

    ptrSnsFrmCxt = &context->ptrSensorFrameContext[
            (ptrWdCfg->firstSlotId * frameSize) + CY_CAPSENSE_SNS_CTL_INDEX];

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
        if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == (ptrWdCfg->wdType))
        {
            frameSize = CY_MSCLP_11_SNS_REGS;
            ptrSnsFrmCxt = &context->ptrSensorFrameLpContext[
                    (ptrWdCfg->firstSlotId * frameSize) + CY_CAPSENSE_FRM_LP_SNS_CTL_INDEX];
        }
    #endif

    if (0u != Cy_CapSense_IsWidgetEnabled(widgetId, context))
    {
        wdStatus = MSCLP_SNS_SNS_CTL_VALID_Msk;
    }

    /* Update sensor frame structure */
    for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
    {
        *ptrSnsFrmCxt &= (uint32_t)~MSCLP_SNS_SNS_CTL_VALID_Msk;
        *ptrSnsFrmCxt |= wdStatus;
        ptrSnsFrmCxt = &ptrSnsFrmCxt[frameSize];
    }
}
#endif /* #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */


/*******************************************************************************
* Function Name: Cy_CapSense_IsWidgetEnabled
****************************************************************************//**
*
* Returns widget enable/working status.
*
* \param widgetId
* Specifies the widget ID number. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context
* structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the widget:
* - Zero - The specified widget is disabled and / or non-working or
* the specified parameter is invalid.
* - Non-zero - The specified widget is enabled and working.
*
*******************************************************************************/
uint32_t Cy_CapSense_IsWidgetEnabled(
                uint32_t widgetId,
                const cy_stc_capsense_context_t * context)
{
    uint32_t capStatus = 0u;

    if (widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
    {
        if ((CY_CAPSENSE_WD_ENABLE_MASK | CY_CAPSENSE_WD_WORKING_MASK) ==
                (context->ptrWdContext[widgetId].status &
                (CY_CAPSENSE_WD_ENABLE_MASK | CY_CAPSENSE_WD_WORKING_MASK)))
        {
            capStatus = 1u;
        }
    }
    return capStatus;
}


#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
/*******************************************************************************
* Function Name: Cy_CapSense_IsSlotEnabled
****************************************************************************//**
*
* Returns slot enable/working status.
*
* \param slotId
* Specifies the slot ID number.
*
* \param context
* The pointer to the CAPSENSE&trade; context
* structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified slot:
* - Zero - The specified slot has disabled and / or non-working widgets on all
* channels or the specified parameter is invalid.
* - Non-zero - The specified slot has at least one widget enabled and working.
*
*******************************************************************************/
uint32_t Cy_CapSense_IsSlotEnabled(
                uint32_t slotId,
                const cy_stc_capsense_context_t * context)
{
    uint32_t capStatus = 0u;
    uint32_t wdIndex;
    uint32_t chIndex;

    for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
    {
        wdIndex = context->ptrScanSlots[(chIndex * CY_CAPSENSE_SLOT_COUNT) + slotId].wdId;
        if (CY_CAPSENSE_SLOT_SHIELD_ONLY > wdIndex)
        {
            if (0u != Cy_CapSense_IsWidgetEnabled(wdIndex, context))
            {
                capStatus = 1u;
                break;
            }
        }
    }
    return capStatus;
}
#endif

#if (CY_CAPSENSE_LIQUID_LEVEL_TANK_REMOVAL_DETECTION_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_IsTankRemoved
****************************************************************************//**
*
* Returns the presence or absence status of a physical tank connected to the device.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
* It is applicable for Liquid Level and Liquid Presence widgets when the tank
* removal detection feature is enabled.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the presence or absence status of a physical tank:
* - 1 - Tank is detected (present).
* - 0 - Tank is not detected (absent).
*
*******************************************************************************/
uint8_t Cy_CapSense_IsTankRemoved(uint32_t widgetId, cy_stc_capsense_context_t * context)
{
    return (0u != (context->ptrWdContext[widgetId].status & CY_CAPSENSE_WD_TANK_REMOVAL_DETECTION_MASK)) ? 1u : 0u;
}
#endif


