zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_structure.c
/*******************************************************************************
* Function Name: Cy_Capsense_GetFingerType
****************************************************************************//**
*
* Returns the detected finger/object type for the specified linear slider 
* widget based on the Small/Large Slider classification algorithm.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t
* generated by the CAPSENSE&trade; Configurator tool. The structure contains both, CAPSENSE&trade;
* configuration and internal data and it is used during whole CAPSENSE&trade; operation.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \return
* Returns the detected finger/object type:
* - CY_CAPSENSE_FINGER_TYPE_NONE         - Finger type has not detected.
* - CY_CAPSENSE_FINGER_TYPE_NORMAL       - Normal finger type. 
* - CY_CAPSENSE_FINGER_TYPE_FAT          - Fat finger type.
* - CY_CAPSENSE_FINGER_TYPE_LARGE_OBJECT - Large finger type.
*
*******************************************************************************/
uint8_t Cy_Capsense_GetFingerType(cy_stc_capsense_context_t * context, uint32_t widgetId)
{
    uint8_t fingerType = CY_CAPSENSE_FINGER_TYPE_NONE;

    if ((uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E == context->ptrWdConfig[widgetId].wdType)
    {
        fingerType = (uint8_t)((context->ptrWdContext[widgetId].status & CY_CAPSENSE_WD_FINGER_TYPE_MASK) >> CY_CAPSENSE_WD_FINGER_TYPE_POS);
    }

    return fingerType;
}


#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP)) */


/* [] END OF FILE */
